my_list = [42, 69, 322, 13, 0]
numb=[]
for i in my_list:                            # перебирает все значения из выбранной переменной по очереди
    if i<0:
        numb.append(i)
    else:
        print(i)
###########################################################################################################
my_list = [42, 69, 322, 13, 0]
for i in range(len(my_list)):                # перебирает все значения по очереди (0-бесконечность) N количество раз
    my_list[i]=':('
print(my_list)
###########################################################################################################
# for i in range(1,11):                        # start, stop, step
#     for j in range(1,11):
#         print(f'{i}x{j}={i*j}')
###########################################################################################################
dict={'a':1,'b':2,'c':3}
for i, k in dict.items():
    print(i, k)